
All tests passed successfully for `reference_architectures/foundry_standard_private` ✅

**Workflow Run:** [17221685694](https://github.com/microsoft/CAIRA/actions/runs/17221685694)

#### 🔢 Terraform Version and Platform: `1.13.0/linux_amd64`

#### 🖌 Terraform Format and Style: `success ✅`

#### ⚙️ Terraform Initialization: `success ✅`

#### 🤖 Terraform Validation: `success ✅`

<details><summary>Show Output</summary>

```text
Success! The configuration is valid.


```

</details>



<details><summary>Show Error</summary>

```text

```

</details>



#### 🩺 Terraform Plan Exit Code: `2`

<details><summary>Show Output</summary>

```text
module.application_insights.data.modtm_module_source.telemetry[0]: Reading...
module.application_insights.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.capability_host_resources.data.azapi_resource.ai_search: Reading...
module.capability_host_resources.data.azapi_resource.ai_search: Read complete after 2s [id=/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Search/searchServices/srch-privateenv-hp9ss]
module.application_insights.data.azurerm_client_config.telemetry[0]: Reading...
module.application_insights.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02NzRlNzc3MS1iYmNlLTQwMGMtOWM2OS1lMThhMTZlNDNlZDY7b2JqZWN0SWQ9ZDhlNDQyYzUtM2YzNy00MjU5LThlZWItYzQxMzhlZjg1NjM1O3N1YnNjcmlwdGlvbklkPTdhZWMzNjBiLTM1NGUtNGMzYS1iMmU2LWE2NDYyYTc0OTBiZjt0ZW5hbnRJZD0yOTdmMDg1Ny1mZWQ0LTRmNjUtOTAzOS01MWJiMDdlM2ZiMDQ=]
module.capability_host_resources.data.azurerm_cosmosdb_account.cosmosdb: Reading...
module.capability_host_resources.data.azurerm_storage_account.storage_account: Reading...
module.ai_foundry.data.azurerm_private_dns_zone.ai_services[0]: Reading...
module.ai_foundry.data.azurerm_client_config.current: Reading...
module.ai_foundry.data.azurerm_private_dns_zone.cognitive[0]: Reading...
module.ai_foundry.data.azurerm_private_dns_zone.openai[0]: Reading...
module.ai_foundry.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02NzRlNzc3MS1iYmNlLTQwMGMtOWM2OS1lMThhMTZlNDNlZDY7b2JqZWN0SWQ9ZDhlNDQyYzUtM2YzNy00MjU5LThlZWItYzQxMzhlZjg1NjM1O3N1YnNjcmlwdGlvbklkPTdhZWMzNjBiLTM1NGUtNGMzYS1iMmU2LWE2NDYyYTc0OTBiZjt0ZW5hbnRJZD0yOTdmMDg1Ny1mZWQ0LTRmNjUtOTAzOS01MWJiMDdlM2ZiMDQ=]
module.ai_foundry.data.azurerm_private_dns_zone.openai[0]: Read complete after 0s [id=/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/privateDnsZones/privatelink.openai.azure.com]
module.ai_foundry.data.azurerm_private_dns_zone.ai_services[0]: Read complete after 0s [id=/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/privateDnsZones/privatelink.services.ai.azure.com]
module.ai_foundry.data.azurerm_private_dns_zone.cognitive[0]: Read complete after 0s [id=/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com]
module.capability_host_resources.data.azurerm_storage_account.storage_account: Read complete after 2s [id=/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Storage/storageAccounts/stprivateenvhp9ss]
module.capability_host_resources.data.azurerm_cosmosdb_account.cosmosdb: Read complete after 4s [id=/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "swedencentral"
      + name                            = (known after apply)
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = (known after apply)
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_resource_group.this[0] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = (known after apply)
    }

  # module.ai_foundry.azapi_resource.ai_foundry will be created
  + resource "azapi_resource" "ai_foundry" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + kind       = "AIServices"
          + properties = {
              + allowProjectManagement = true
              + customSubDomainName    = (known after apply)
              + disableLocalAuth       = false
              + networkAcls            = {
                  + defaultAction = "Allow"
                }
              + networkInjections      = [
                  + {
                      + scenario                   = "agent"
                      + subnetArmId                = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/virtualNetworks/vnet-privateenv-hp9ss/subnets/agent"
                      + useMicrosoftManagedNetwork = false
                    },
                ]
              + publicNetworkAccess    = "Disabled"
            }
          + sku        = {
              + name = "S0"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "swedencentral"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.ai_foundry_project will be created
  + resource "azapi_resource" "ai_foundry_project" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + properties = {
              + description = "Default Project description"
              + displayName = "Default Project"
            }
          + sku        = {
              + name = "S0"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "swedencentral"
      + name                      = "default-project"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
          + "properties.internalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.CognitiveServices/accounts/projects@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.ai_foundry_project_capability_host[0] will be created
  + resource "azapi_resource" "ai_foundry_project_capability_host" {
      + body                             = {
          + properties = {
              + capabilityHostKind       = "Agents"
              + storageConnections       = [
                  + "stprivateenvhp9ss",
                ]
              + threadStorageConnections = [
                  + "cosmos-privateenv-hp9ss",
                ]
              + vectorStoreConnections   = [
                  + "srch-privateenv-hp9ss",
                ]
            }
        }
      + id                               = (known after apply)
      + ignore_casing                    = false
      + ignore_missing_property          = true
      + ignore_null_property             = false
      + name                             = "agents-capability-host"
      + output                           = (known after apply)
      + parent_id                        = (known after apply)
      + replace_triggers_external_values = {
          + ai_search                        = {
              + location    = "swedencentral"
              + name        = "srch-privateenv-hp9ss"
              + resource_id = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Search/searchServices/srch-privateenv-hp9ss"
            }
          + cosmos_db                        = {
              + endpoint            = "https://cosmos-privateenv-hp9ss.documents.azure.com:443/"
              + location            = "swedencentral"
              + name                = "cosmos-privateenv-hp9ss"
              + resource_group_name = "rg-privateenv-hp9ss"
              + resource_id         = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss"
            }
          + create_required_role_assignments = true
          + storage_account                  = {
              + location              = "swedencentral"
              + name                  = "stprivateenvhp9ss"
              + primary_blob_endpoint = "https://stprivateenvhp9ss.blob.core.windows.net/"
              + resource_id           = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Storage/storageAccounts/stprivateenvhp9ss"
            }
        }
      + schema_validation_enabled        = false
      + sensitive_body                   = (write-only attribute)
      + type                             = "Microsoft.CognitiveServices/accounts/projects/capabilityHosts@2025-04-01-preview"
    }

  # module.ai_foundry.azapi_resource.ai_search_connection[0] will be created
  + resource "azapi_resource" "ai_search_connection" {
      + body                      = {
          + name       = "srch-privateenv-hp9ss"
          + properties = {
              + authType = "AAD"
              + category = "CognitiveSearch"
              + metadata = {
                  + ApiType    = "Azure"
                  + ApiVersion = "2025-05-01-preview"
                  + ResourceId = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Search/searchServices/srch-privateenv-hp9ss"
                  + location   = "swedencentral"
                }
              + target   = "https://srch-privateenv-hp9ss.search.windows.net"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "srch-privateenv-hp9ss"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.appinsights_connection[0] will be created
  + resource "azapi_resource" "appinsights_connection" {
      + body                      = {
          + name       = (known after apply)
          + properties = {
              + authType      = "ApiKey"
              + category      = "AppInsights"
              + credentials   = {
                  + key = (sensitive value)
                }
              + isSharedToAll = false
              + metadata      = {
                  + ApiType    = "Azure"
                  + ResourceId = (known after apply)
                }
              + target        = (known after apply)
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.cosmosdb_connection[0] will be created
  + resource "azapi_resource" "cosmosdb_connection" {
      + body                      = {
          + name       = "cosmos-privateenv-hp9ss"
          + properties = {
              + authType = "AAD"
              + category = "CosmosDb"
              + metadata = {
                  + ApiType    = "Azure"
                  + ResourceId = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss"
                  + location   = "swedencentral"
                }
              + target   = "https://cosmos-privateenv-hp9ss.documents.azure.com:443/"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "cosmos-privateenv-hp9ss"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.storage_connection[0] will be created
  + resource "azapi_resource" "storage_connection" {
      + body                      = {
          + name       = "stprivateenvhp9ss"
          + properties = {
              + authType = "AAD"
              + category = "AzureStorageAccount"
              + metadata = {
                  + ApiType    = "Azure"
                  + ResourceId = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Storage/storageAccounts/stprivateenvhp9ss"
                  + location   = "swedencentral"
                }
              + target   = "https://stprivateenvhp9ss.blob.core.windows.net/"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "stprivateenvhp9ss"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource_action.purge_ai_foundry will be created
  + resource "azapi_resource_action" "purge_ai_foundry" {
      + id               = (known after apply)
      + method           = "DELETE"
      + output           = (known after apply)
      + resource_id      = (known after apply)
      + sensitive_output = (sensitive value)
      + type             = "Microsoft.Resources/resourceGroups/deletedAccounts@2021-04-30"
      + when             = "destroy"
    }

  # module.ai_foundry.azurerm_cognitive_deployment.model_deployments["gpt-4o"] will be created
  + resource "azurerm_cognitive_deployment" "model_deployments" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "gpt-4o"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4o"
          + version = "2024-11-20"
        }

      + sku {
          + capacity = 1
          + name     = "GlobalStandard"
        }
    }

  # module.ai_foundry.azurerm_cosmosdb_sql_role_assignment.cosmosdb_db_sql_role_aifp_entity_store_name[0] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "cosmosdb_db_sql_role_aifp_entity_store_name" {
      + account_name        = "cosmos-privateenv-hp9ss"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "rg-privateenv-hp9ss"
      + role_definition_id  = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = (known after apply)
    }

  # module.ai_foundry.azurerm_cosmosdb_sql_role_assignment.cosmosdb_db_sql_role_aifp_system_thread_name[0] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "cosmosdb_db_sql_role_aifp_system_thread_name" {
      + account_name        = "cosmos-privateenv-hp9ss"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "rg-privateenv-hp9ss"
      + role_definition_id  = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = (known after apply)
    }

  # module.ai_foundry.azurerm_cosmosdb_sql_role_assignment.cosmosdb_db_sql_role_aifp_user_thread_message_store[0] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "cosmosdb_db_sql_role_aifp_user_thread_message_store" {
      + account_name        = "cosmos-privateenv-hp9ss"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "rg-privateenv-hp9ss"
      + role_definition_id  = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = (known after apply)
    }

  # module.ai_foundry.azurerm_private_endpoint.ai_foundry_pe[0] will be created
  + resource "azurerm_private_endpoint" "ai_foundry_pe" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "swedencentral"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = (known after apply)
      + subnet_id                = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/virtualNetworks/vnet-privateenv-hp9ss/subnets/connections"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + priv ...
```

</details>

Output is too long and was truncated. You can read full output in the [17221685694](https://github.com/microsoft/CAIRA/actions/runs/17221685694) workflow run.

<details><summary>Show Error</summary>

```text

```

</details>



#### 📖 Terraform Plan: `success ✅`

<details><summary>Show Output</summary>

```text

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_log_analytics_workspace.this will be created
+   resource "azurerm_log_analytics_workspace" "this" {
+       allow_resource_only_permissions = true
+       daily_quota_gb                  = -1
+       id                              = (known after apply)
+       internet_ingestion_enabled      = true
+       internet_query_enabled          = true
+       local_authentication_disabled   = (known after apply)
+       local_authentication_enabled    = (known after apply)
+       location                        = "swedencentral"
+       name                            = (known after apply)
+       primary_shared_key              = (sensitive value)
+       resource_group_name             = (known after apply)
+       retention_in_days               = 30
+       secondary_shared_key            = (sensitive value)
+       sku                             = "PerGB2018"
+       workspace_id                    = (known after apply)
    }

  # azurerm_resource_group.this[0] will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "swedencentral"
+       name     = (known after apply)
    }

  # module.ai_foundry.azapi_resource.ai_foundry will be created
+   resource "azapi_resource" "ai_foundry" {
+       body                      = {
+           identity   = {
+               type = "SystemAssigned"
            }
+           kind       = "AIServices"
+           properties = {
+               allowProjectManagement = true
+               customSubDomainName    = (known after apply)
+               disableLocalAuth       = false
+               networkAcls            = {
+                   defaultAction = "Allow"
                }
+               networkInjections      = [
+                   {
+                       scenario                   = "agent"
+                       subnetArmId                = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/virtualNetworks/vnet-privateenv-hp9ss/subnets/agent"
+                       useMicrosoftManagedNetwork = false
                    },
                ]
+               publicNetworkAccess    = "Disabled"
            }
+           sku        = {
+               name = "S0"
            }
        }
+       id                        = (known after apply)
+       ignore_casing             = false
+       ignore_missing_property   = true
+       ignore_null_property      = false
+       location                  = "swedencentral"
+       name                      = (known after apply)
+       output                    = (known after apply)
+       parent_id                 = (known after apply)
+       schema_validation_enabled = false
+       sensitive_body            = (write-only attribute)
+       tags                      = (known after apply)
+       type                      = "Microsoft.CognitiveServices/accounts@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.ai_foundry_project will be created
+   resource "azapi_resource" "ai_foundry_project" {
+       body                      = {
+           identity   = {
+               type = "SystemAssigned"
            }
+           properties = {
+               description = "Default Project description"
+               displayName = "Default Project"
            }
+           sku        = {
+               name = "S0"
            }
        }
+       id                        = (known after apply)
+       ignore_casing             = false
+       ignore_missing_property   = true
+       ignore_null_property      = false
+       location                  = "swedencentral"
+       name                      = "default-project"
+       output                    = (known after apply)
+       parent_id                 = (known after apply)
+       response_export_values    = [
+           "identity.principalId",
+           "properties.internalId",
        ]
+       schema_validation_enabled = false
+       sensitive_body            = (write-only attribute)
+       type                      = "Microsoft.CognitiveServices/accounts/projects@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.ai_foundry_project_capability_host[0] will be created
+   resource "azapi_resource" "ai_foundry_project_capability_host" {
+       body                             = {
+           properties = {
+               capabilityHostKind       = "Agents"
+               storageConnections       = [
+                   "stprivateenvhp9ss",
                ]
+               threadStorageConnections = [
+                   "cosmos-privateenv-hp9ss",
                ]
+               vectorStoreConnections   = [
+                   "srch-privateenv-hp9ss",
                ]
            }
        }
+       id                               = (known after apply)
+       ignore_casing                    = false
+       ignore_missing_property          = true
+       ignore_null_property             = false
+       name                             = "agents-capability-host"
+       output                           = (known after apply)
+       parent_id                        = (known after apply)
+       replace_triggers_external_values = {
+           ai_search                        = {
+               location    = "swedencentral"
+               name        = "srch-privateenv-hp9ss"
+               resource_id = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Search/searchServices/srch-privateenv-hp9ss"
            }
+           cosmos_db                        = {
+               endpoint            = "https://cosmos-privateenv-hp9ss.documents.azure.com:443/"
+               location            = "swedencentral"
+               name                = "cosmos-privateenv-hp9ss"
+               resource_group_name = "rg-privateenv-hp9ss"
+               resource_id         = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss"
            }
+           create_required_role_assignments = true
+           storage_account                  = {
+               location              = "swedencentral"
+               name                  = "stprivateenvhp9ss"
+               primary_blob_endpoint = "https://stprivateenvhp9ss.blob.core.windows.net/"
+               resource_id           = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Storage/storageAccounts/stprivateenvhp9ss"
            }
        }
+       schema_validation_enabled        = false
+       sensitive_body                   = (write-only attribute)
+       type                             = "Microsoft.CognitiveServices/accounts/projects/capabilityHosts@2025-04-01-preview"
    }

  # module.ai_foundry.azapi_resource.ai_search_connection[0] will be created
+   resource "azapi_resource" "ai_search_connection" {
+       body                      = {
+           name       = "srch-privateenv-hp9ss"
+           properties = {
+               authType = "AAD"
+               category = "CognitiveSearch"
+               metadata = {
+                   ApiType    = "Azure"
+                   ApiVersion = "2025-05-01-preview"
+                   ResourceId = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Search/searchServices/srch-privateenv-hp9ss"
+                   location   = "swedencentral"
                }
+               target   = "https://srch-privateenv-hp9ss.search.windows.net"
            }
        }
+       id                        = (known after apply)
+       ignore_casing             = false
+       ignore_missing_property   = true
+       ignore_null_property      = false
+       name                      = "srch-privateenv-hp9ss"
+       output                    = (known after apply)
+       parent_id                 = (known after apply)
+       response_export_values    = [
+           "identity.principalId",
        ]
+       schema_validation_enabled = false
+       sensitive_body            = (write-only attribute)
+       type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.appinsights_connection[0] will be created
+   resource "azapi_resource" "appinsights_connection" {
+       body                      = {
+           name       = (known after apply)
+           properties = {
+               authType      = "ApiKey"
+               category      = "AppInsights"
+               credentials   = {
+                   key = (sensitive value)
                }
+               isSharedToAll = false
+               metadata      = {
+                   ApiType    = "Azure"
+                   ResourceId = (known after apply)
                }
+               target        = (known after apply)
            }
        }
+       id                        = (known after apply)
+       ignore_casing             = false
+       ignore_missing_property   = true
+       ignore_null_property      = false
+       location                  = (known after apply)
+       name                      = (known after apply)
+       output                    = (known after apply)
+       parent_id                 = (known after apply)
+       schema_validation_enabled = false
+       sensitive_body            = (write-only attribute)
+       tags                      = (known after apply)
+       type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.cosmosdb_connection[0] will be created
+   resource "azapi_resource" "cosmosdb_connection" {
+       body                      = {
+           name       = "cosmos-privateenv-hp9ss"
+           properties = {
+               authType = "AAD"
+               category = "CosmosDb"
+               metadata = {
+                   ApiType    = "Azure"
+                   ResourceId = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss"
+                   location   = "swedencentral"
                }
+               target   = "https://cosmos-privateenv-hp9ss.documents.azure.com:443/"
            }
        }
+       id                        = (known after apply)
+       ignore_casing             = false
+       ignore_missing_property   = true
+       ignore_null_property      = false
+       name                      = "cosmos-privateenv-hp9ss"
+       output                    = (known after apply)
+       parent_id                 = (known after apply)
+       schema_validation_enabled = false
+       sensitive_body            = (write-only attribute)
+       type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource.storage_connection[0] will be created
+   resource "azapi_resource" "storage_connection" {
+       body                      = {
+           name       = "stprivateenvhp9ss"
+           properties = {
+               authType = "AAD"
+               category = "AzureStorageAccount"
+               metadata = {
+                   ApiType    = "Azure"
+                   ResourceId = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Storage/storageAccounts/stprivateenvhp9ss"
+                   location   = "swedencentral"
                }
+               target   = "https://stprivateenvhp9ss.blob.core.windows.net/"
            }
        }
+       id                        = (known after apply)
+       ignore_casing             = false
+       ignore_missing_property   = true
+       ignore_null_property      = false
+       name                      = "stprivateenvhp9ss"
+       output                    = (known after apply)
+       parent_id                 = (known after apply)
+       response_export_values    = [
+           "identity.principalId",
        ]
+       schema_validation_enabled = false
+       sensitive_body            = (write-only attribute)
+       type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-06-01"
    }

  # module.ai_foundry.azapi_resource_action.purge_ai_foundry will be created
+   resource "azapi_resource_action" "purge_ai_foundry" {
+       id               = (known after apply)
+       method           = "DELETE"
+       output           = (known after apply)
+       resource_id      = (known after apply)
+       sensitive_output = (sensitive value)
+       type             = "Microsoft.Resources/resourceGroups/deletedAccounts@2021-04-30"
+       when             = "destroy"
    }

  # module.ai_foundry.azurerm_cognitive_deployment.model_deployments["gpt-4o"] will be created
+   resource "azurerm_cognitive_deployment" "model_deployments" {
+       cognitive_account_id   = (known after apply)
+       id                     = (known after apply)
+       name                   = "gpt-4o"
+       version_upgrade_option = "OnceNewDefaultVersionAvailable"

+       model {
+           format  = "OpenAI"
+           name    = "gpt-4o"
+           version = "2024-11-20"
        }

+       sku {
+           capacity = 1
+           name     = "GlobalStandard"
        }
    }

  # module.ai_foundry.azurerm_cosmosdb_sql_role_assignment.cosmosdb_db_sql_role_aifp_entity_store_name[0] will be created
+   resource "azurerm_cosmosdb_sql_role_assignment" "cosmosdb_db_sql_role_aifp_entity_store_name" {
+       account_name        = "cosmos-privateenv-hp9ss"
+       id                  = (known after apply)
+       name                = (known after apply)
+       principal_id        = (known after apply)
+       resource_group_name = "rg-privateenv-hp9ss"
+       role_definition_id  = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
+       scope               = (known after apply)
    }

  # module.ai_foundry.azurerm_cosmosdb_sql_role_assignment.cosmosdb_db_sql_role_aifp_system_thread_name[0] will be created
+   resource "azurerm_cosmosdb_sql_role_assignment" "cosmosdb_db_sql_role_aifp_system_thread_name" {
+       account_name        = "cosmos-privateenv-hp9ss"
+       id                  = (known after apply)
+       name                = (known after apply)
+       principal_id        = (known after apply)
+       resource_group_name = "rg-privateenv-hp9ss"
+       role_definition_id  = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
+       scope               = (known after apply)
    }

  # module.ai_foundry.azurerm_cosmosdb_sql_role_assignment.cosmosdb_db_sql_role_aifp_user_thread_message_store[0] will be created
+   resource "azurerm_cosmosdb_sql_role_assignment" "cosmosdb_db_sql_role_aifp_user_thread_message_store" {
+       account_name        = "cosmos-privateenv-hp9ss"
+       id                  = (known after apply)
+       name                = (known after apply)
+       principal_id        = (known after apply)
+       resource_group_name = "rg-privateenv-hp9ss"
+       role_definition_id  = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
+       scope               = (known after apply)
    }

  # module.ai_foundry.azurerm_private_endpoint.ai_foundry_pe[0] will be created
+   resource "azurerm_private_endpoint" "ai_foundry_pe" {
+       custom_dns_configs       = (known after apply)
+       id                       = (known after apply)
+       location                 = "swedencentral"
+       name                     = (known after apply)
+       network_interface        = (known after apply)
+       private_dns_zone_configs = (known after apply)
+       resource_group_name      = (known after apply)
+       subnet_id                = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/virtualNetworks/vnet-privateenv-hp9ss/subnets/connections"

+       private_dns_zone_group {
+           id                   = (known after apply)
+           name                 = "default"
+           private_dns_zone_ids = [
+               "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com",
+               "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/privateDnsZones/privatelink.services.ai.azure.com",
+               "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Network/privateDnsZones/privatelink.openai.azure.com",
            ]
        }

+       private_service_connection {
+           is_manual_connection           = false
+           name                           = (known after apply)
+           private_connection_resource_id = (known after apply)
+           private_ip_address             = (known after apply)
+           subresource_names              = [
+               "account",
            ]
        }
    }

  # module.ai_foundry.azurerm_role_assignment.cosmosdb_operator_ai_foundry_project[0] will be created
+   resource "azurerm_role_assignment" "cosmosdb_operator_ai_foundry_project" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Cosmos DB Operator"
+       scope                            = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-privateenv-hp9ss"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.azurerm_role_assignment.search_index_data_contributor_ai_foundry_project[0] will be created
+   resource "azurerm_role_assignment" "search_index_data_contributor_ai_foundry_project" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Search Index Data Contributor"
+       scope                            = "/subscriptions/7aec360b-354e-4c3a-b2e6-a6462a7490bf/resourceGroups/rg-privateenv-hp9ss/providers/Microsoft.Search/searchServices/srch-privateenv-hp9ss"
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.azurerm_role_assignment.search_service_contributor_ai_foundry_project[0] will be created
+   resource "azurerm_role_assignment" "search_service_contributor_ai_foundry_project" {
+       condition_v ...
```

</details>

Output is too long and was truncated. You can read full output in the [17221685694](https://github.com/microsoft/CAIRA/actions/runs/17221685694) workflow run.



*Pusher: @timfpark, Action: `pull_request`, Working Directory: `reference_architectures/foundry_standard_private`, Workflow: `Terraform Test`*
